using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Pich_Milioner
{
    internal class Sprites
    {
        Sounds sounds = new Sounds();
        public void DevNAme()
        {
            Console.WriteLine(@"
 __       __                                              __                        
|  \     /  \                                            |  \                       
| ▓▓\   /  ▓▓ ______   ______  _______   ______  ________ \▓▓__    __ ______ ____   
| ▓▓▓\ /  ▓▓▓|      \ /      \|       \ /      \|        \  \  \  |  \      \    \  
| ▓▓▓▓\  ▓▓▓▓ \▓▓▓▓▓▓\  ▓▓▓▓▓▓\ ▓▓▓▓▓▓▓\  ▓▓▓▓▓▓\\▓▓▓▓▓▓▓▓ ▓▓ ▓▓  | ▓▓ ▓▓▓▓▓▓\▓▓▓▓\ 
| ▓▓\▓▓ ▓▓ ▓▓/      ▓▓ ▓▓  | ▓▓ ▓▓  | ▓▓ ▓▓    ▓▓ /    ▓▓| ▓▓ ▓▓  | ▓▓ ▓▓ | ▓▓ | ▓▓ 
| ▓▓ \▓▓▓| ▓▓  ▓▓▓▓▓▓▓ ▓▓__| ▓▓ ▓▓  | ▓▓ ▓▓▓▓▓▓▓▓/  ▓▓▓▓_| ▓▓ ▓▓__/ ▓▓ ▓▓ | ▓▓ | ▓▓ 
| ▓▓  \▓ | ▓▓\▓▓    ▓▓\▓▓    ▓▓ ▓▓  | ▓▓\▓▓     \  ▓▓    \ ▓▓\▓▓    ▓▓ ▓▓ | ▓▓ | ▓▓ 
 \▓▓      \▓▓ \▓▓▓▓▓▓▓_\▓▓▓▓▓▓▓\▓▓   \▓▓ \▓▓▓▓▓▓▓\▓▓▓▓▓▓▓▓\▓▓ \▓▓▓▓▓▓ \▓▓  \▓▓  \▓▓ 
                     |  \__| ▓▓                                                                                     
                      \▓▓    ▓▓                                                                                     
                       \▓▓▓▓▓▓                        
    _______                     
   |       \                    
   | ▓▓▓▓▓▓▓\ ______  __     __ 
   | ▓▓  | ▓▓/      \|  \   /  \
   | ▓▓  | ▓▓  ▓▓▓▓▓▓\\▓▓\ /  ▓▓
   | ▓▓  | ▓▓ ▓▓    ▓▓ \▓▓\  ▓▓ 
   | ▓▓__/ ▓▓ ▓▓▓▓▓▓▓▓  \▓▓ ▓▓  __
   | ▓▓    ▓▓\▓▓     \   \▓▓▓  |  \
    \▓▓▓▓▓▓▓  \▓▓▓▓▓▓▓    \▓    \▓▓  

                                                                                                         
");
        }
        public void GmTitle1()
        {
            Console.ForegroundColor = ConsoleColor.Green;
            Console.WriteLine(@"            

         ╔════════════════════════════╗
         ║ ВЫБОР РЕЖИМА               ║
         ╚════════════════════════════╝");
            Console.WriteLine("\n");

        }
        public void Title1()
        {
            Console.ForegroundColor = ConsoleColor.Green;
            Console.Write(@"            

         ╔══════════════════════════════════════╗
         ║ КТО ХОЧЕТ СТАТЬ МИЛИОНЕРОЙ??         ║
         ╚══════════════════════════════════════╝");
            Console.WriteLine("\n");

        }

        public void Rules()
        {
            Console.WriteLine("\u001b[38;5;44m         ██████╗ ██╗   ██╗██╗     ███████╗███████╗");
            Console.WriteLine("         ██╔══██╗██║   ██║██║     ██╔════╝██╔════╝");
            Console.WriteLine("         ██████╔╝██║   ██║██║     █████╗  ███████╗");
            Console.WriteLine("         ██╔══██╗██║   ██║██║     ██╔══╝  ╚════██║");
            Console.WriteLine("         ██║  ██║╚██████╔╝███████╗███████╗███████║");
            Console.WriteLine("         ╚═╝  ╚═╝ ╚═════╝ ╚══════╝╚══════╝╚══════╝\u001b[38;5;42m");
            Console.WriteLine("         ╔══════════════════════════════════════════════╗");
            Console.WriteLine("         ║ Привет !                                     ║");
            Console.WriteLine("         ║ В этой игре тебе предстоит заработать        ║");
            Console.WriteLine("         ║ миллион очков для победы. отвечайте          ║");
            Console.WriteLine("         ║ на вопросы разной сложности на время и       ║");
            Console.WriteLine("         ║ получайте вознаграждение, вам будут          ║");
            Console.WriteLine("         ║ доступны подсказки и прочие примочки         ║");
            Console.WriteLine("         ║ из 4х ответов только 1 является верным       ║");
            Console.WriteLine("         ║ удачной игры!                                ║");
            Console.WriteLine("         ║ основной функционал реализован но не         ║");
            Console.WriteLine("         ║ доконца, изза недостатка времени и           ║");
            Console.WriteLine("         ║ учебы в университете, поэтому строго         ║");
            Console.WriteLine("         ║ не судите :(                                 ║");
            Console.WriteLine("         ║ \u001b[38;5;234mесли вы не                            \u001b[38;5;42m       ║");
            Console.WriteLine("         ║ \u001b[38;5;234mнабиарете нужного количества очьков   \u001b[38;5;42m       ║");
            Console.WriteLine("         ║ \u001b[38;5;234mа вопросы закончатся, то вы доболвольно  \u001b[38;5;42m    ║");
            Console.WriteLine("         ║ \u001b[38;5;234mотдаете свою душу разработчику,       \u001b[38;5;42m       ║");
            Console.WriteLine("         ║ \u001b[38;5;234mбез шанса вернуть её обратно.         \u001b[38;5;42m       ║");
            Console.WriteLine("         ║                                              ║");
            Console.WriteLine("         ╚══════════════════════════════════════════════╝");
            Console.WriteLine("                                                         ");
            Console.WriteLine("           \u001b[38;5;11m Я ОЗНАКОМЛЕН И СОГЛАСЕН\u001b[38;5;246m");
            Console.WriteLine("            ( любая клавиша )");

        }

        public void Donate_screen()
        {
            Console.WriteLine(@"▄████▄   ███▄ ▄███▓▓█████   ████▓     ▒█████                            .                . 
▒██▀ ▀█  ▓██▒▀█▀ ██▒▓█   ▀▒▓██ ▓██▒   ▒██▒  ██▒                         :""-.          .-"";                    
▒▓█    ▄ ▓██    ▓██░▒███  ░▒██ ▒██░   ▒██░  ██▒                         |:`.`.__..__.'.';|       
▒▓▓▄ ▄██ ▒██    ▒██ ▒▓█  ▄ ░██ ▒██░   ▒██   ██░                         || :-""      ""-; ||     
▒ ▓███▀ ▒▒██▒   ░██▒░▒████ ░██  ░████░ ████▓▒░                          :;              :;       
░ ░▒ ▒  ░░ ▒░   ░  ░░░ ▒░  ░▓ ░ ▒░▓  ░ ▒░▒░▒░                           /  .==.    .==.  \       
                                                                       :    █ _.--._█     ;      
▄▄▄█████▓ ▄▄▄      ██                                                  ; .--.' `--' `.--. :      
 ▓  ██▒ ▓▒▓██     ▒▓██                                                :   __;`      ':__   ;     
 ▒ ▓██░ ▒░▒██    █░▒██                                                ;  '  '-._:;_.-'  '  :     
 ░ ▓██▓ ░ ▒██░█▀   ░██                                                '.       `--'       .'     
  ▒██▒ ░ ░▓█  ▀█▓ ░██                                                  .""-._          _.-"".    
  ▒ ░░   ░▒▓███▀▒ ░▓                                                 .'     """"------""""     `.
                                                                    /`-                    -'\   
  ██░ ██  ▄▄▄       ██  ██  ██ ▄▄▄       ████▓                     /`-                      -'\  
 ▒▓██░ ██ ▒████▄   ▒▓██▒▓██▒▓██▒████▄   ▒▓██▓██▒                  :`-   .'              `.   -'; 
 ░▒██▀▀██ ▒██  ▀█▄ ░▒██████████▒██  ▀█▄ ░▒██▒██░                  ;    /                  \    : 
  ░▓█ ░██ ░██▄▄▄██  ░██ ░██ ░██░██▄▄▄▄██ ░██▒██░                 :    :                    ;    ;
 ░▓█▒░██▓ ▓█   ▓██  ░██ ░██ ░██ ▓█   ▓██ ░██  ░███               ;    ;                    :    :
  ▒ ░░▒░▒ ▒▒   ▓▒█  ░▓  ░▓  ░▓  ▒▒   ▓▒█ ░▓   ▒░▓   ██  ██  ██   ':_:.'                    '.;_;'
                                                                   :_                      _;    
                                                                   ; ""-._                -"" :`-.     _.._    
                                                                   :_          ()          _;   ""--::__. `.  
                                                                    \""-                  -""/`._           :  
                                                                   .-""-.                 -""-.  """"--..____.'  
                                                                  /         .__  __.         \               
                                                                 : / ,       / """" \       . \ ;         
                                                                  ""-:___..--""      ""--..___;-""");
        }

        public void QestionsTitle()
        {
            Console.ForegroundColor = ConsoleColor.Cyan;
            Console.WriteLine(@"
     ██████╗  ██████╗ ███████╗██████╗  ██████╗  ██████╗
     ██╔══██╗██╔═══██╗██║  ██║██╔══██╗██╔═══██╗██╔════╝
     ██████╔╝██║   ██║██║  ██║██████╔╝██║   ██║██║     
     ██╔══██╗██║   ██║██║  ██║██╔═══╝ ██║   ██║██║     
     ██████╔╝╚██████╔╝██║  ██║██║     ╚██████╔╝╚██████╗
     ╚═════╝  ╚═════╝ ╚═╝  ╚═╝╚═╝      ╚═════╝  ╚═════╝");
            Console.WriteLine("\n");
            
        }
    }
}
